spairot/M3H6_Blink/Libraries/CMSIS/startup/iar/startup_TMPM3H0.s
                PUBWEAK INTT32A0ACAP0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A0ACAP0_IRQHandler
                B       INTT32A0ACAP0_IRQHandler

                PUBWEAK INTT32A0ACAP1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A0ACAP1_IRQHandler
                B       INTT32A0ACAP1_IRQHandler

                PUBWEAK INTT32A0B_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A0B_IRQHandler
                B       INTT32A0B_IRQHandler

                PUBWEAK INTT32A0BCAP0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A0BCAP0_IRQHandler
                B       INTT32A0BCAP0_IRQHandler

                PUBWEAK INTT32A0BCAP1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A0BCAP1_IRQHandler
                B       INTT32A0BCAP1_IRQHandler

                PUBWEAK INTT32A0C_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A0C_IRQHandler
                B       INTT32A0C_IRQHandler

                PUBWEAK INTT32A0CCAP0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A0CCAP0_IRQHandler
                B       INTT32A0CCAP0_IRQHandler

                PUBWEAK INTT32A0CCAP1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A0CCAP1_IRQHandler
                B       INTT32A0CCAP1_IRQHandler

                PUBWEAK INTT32A1A_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A1A_IRQHandler
                B       INTT32A1A_IRQHandler

                PUBWEAK INTT32A1ACAP0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A1ACAP0_IRQHandler
                B       INTT32A1ACAP0_IRQHandler

                PUBWEAK INTT32A1ACAP1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A1ACAP1_IRQHandler
                B       INTT32A1ACAP1_IRQHandler

                PUBWEAK INTT32A1B_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A1B_IRQHandler
                B       INTT32A1B_IRQHandler

                PUBWEAK INTT32A1BCAP0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A1BCAP0_IRQHandler
                B       INTT32A1BCAP0_IRQHandler

                PUBWEAK INTT32A1BCAP1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A1BCAP1_IRQHandler
                B       INTT32A1BCAP1_IRQHandler

                PUBWEAK INTT32A1C_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A1C_IRQHandler
                B       INTT32A1C_IRQHandler

                PUBWEAK INTT32A1CCAP0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A1CCAP0_IRQHandler
                B       INTT32A1CCAP0_IRQHandler

                PUBWEAK INTT32A1CCAP1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A1CCAP1_IRQHandler
                B       INTT32A1CCAP1_IRQHandler

                PUBWEAK INTT32A2A_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A2A_IRQHandler
                B       INTT32A2A_IRQHandler

                PUBWEAK INTT32A2ACAP0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A2ACAP0_IRQHandler
                B       INTT32A2ACAP0_IRQHandler

                PUBWEAK INTT32A2ACAP1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A2ACAP1_IRQHandler
                B       INTT32A2ACAP1_IRQHandler

                PUBWEAK INTT32A2B_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A2B_IRQHandler
                B       INTT32A2B_IRQHandler

                PUBWEAK INTT32A2BCAP0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A2BCAP0_IRQHandler
                B       INTT32A2BCAP0_IRQHandler

                PUBWEAK INTT32A2BCAP1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A2BCAP1_IRQHandler
                B       INTT32A2BCAP1_IRQHandler

                PUBWEAK INTT32A2C_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A2C_IRQHandler
                B       INTT32A2C_IRQHandler

                PUBWEAK INTT32A2CCAP0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A2CCAP0_IRQHandler
                B       INTT32A2CCAP0_IRQHandler

                PUBWEAK INTT32A2CCAP1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A2CCAP1_IRQHandler
                B       INTT32A2CCAP1_IRQHandler

                PUBWEAK INTT32A3A_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A3A_IRQHandler
                B       INTT32A3A_IRQHandler

                PUBWEAK INTT32A3ACAP0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A3ACAP0_IRQHandler
                B       INTT32A3ACAP0_IRQHandler

                PUBWEAK INTT32A3ACAP1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A3ACAP1_IRQHandler
                B       INTT32A3ACAP1_IRQHandler

                PUBWEAK INTT32A3B_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A3B_IRQHandler
                B       INTT32A3B_IRQHandler

                PUBWEAK INTT32A3BCAP0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A3BCAP0_IRQHandler
                B       INTT32A3BCAP0_IRQHandler

                PUBWEAK INTT32A3BCAP1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A3BCAP1_IRQHandler
                B       INTT32A3BCAP1_IRQHandler

                PUBWEAK INTT32A3C_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A3C_IRQHandler
                B       INTT32A3C_IRQHandler

                PUBWEAK INTT32A3CCAP0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A3CCAP0_IRQHandler
                B       INTT32A3CCAP0_IRQHandler

