spairot/M3H6_Blink/Libraries/CMSIS/startup/iar/startup_TMPM3H0.s
                PUBWEAK INTT32A3CCAP1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A3CCAP1_IRQHandler
                B       INTT32A3CCAP1_IRQHandler

                PUBWEAK INTT32A4A_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A4A_IRQHandler
                B       INTT32A4A_IRQHandler

                PUBWEAK INTT32A4ACAP0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A4ACAP0_IRQHandler
                B       INTT32A4ACAP0_IRQHandler

                PUBWEAK INTT32A4ACAP1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A4ACAP1_IRQHandler
                B       INTT32A4ACAP1_IRQHandler

                PUBWEAK INTT32A4B_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A4B_IRQHandler
                B       INTT32A4B_IRQHandler

                PUBWEAK INTT32A4BCAP0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A4BCAP0_IRQHandler
                B       INTT32A4BCAP0_IRQHandler

                PUBWEAK INTT32A4BCAP1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A4BCAP1_IRQHandler
                B       INTT32A4BCAP1_IRQHandler

                PUBWEAK INTT32A4C_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A4C_IRQHandler
                B       INTT32A4C_IRQHandler

                PUBWEAK INTT32A4CCAP0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A4CCAP0_IRQHandler
                B       INTT32A4CCAP0_IRQHandler

                PUBWEAK INTT32A4CCAP1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A4CCAP1_IRQHandler
                B       INTT32A4CCAP1_IRQHandler

                PUBWEAK INTT32A5A_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A5A_IRQHandler
                B       INTT32A5A_IRQHandler

                PUBWEAK INTT32A5ACAP0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A5ACAP0_IRQHandler
                B       INTT32A5ACAP0_IRQHandler

                PUBWEAK INTT32A5ACAP1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A5ACAP1_IRQHandler
                B       INTT32A5ACAP1_IRQHandler

                PUBWEAK INTT32A5B_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A5B_IRQHandler
                B       INTT32A5B_IRQHandler

                PUBWEAK INTT32A5BCAP0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A5BCAP0_IRQHandler
                B       INTT32A5BCAP0_IRQHandler

                PUBWEAK INTT32A5BCAP1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A5BCAP1_IRQHandler
                B       INTT32A5BCAP1_IRQHandler

                PUBWEAK INTT32A5C_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A5C_IRQHandler
                B       INTT32A5C_IRQHandler

                PUBWEAK INTT32A5CCAP0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A5CCAP0_IRQHandler
                B       INTT32A5CCAP0_IRQHandler

                PUBWEAK INTT32A5CCAP1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTT32A5CCAP1_IRQHandler
                B       INTT32A5CCAP1_IRQHandler

                PUBWEAK INTDMAATC_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTDMAATC_IRQHandler
                B       INTDMAATC_IRQHandler

                PUBWEAK INTDMAAERR_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTDMAAERR_IRQHandler
                B       INTDMAAERR_IRQHandler

                PUBWEAK INTRMC_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTRMC_IRQHandler
                B       INTRMC_IRQHandler

                PUBWEAK INTFLCRDY_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTFLCRDY_IRQHandler
                B       INTFLCRDY_IRQHandler

                PUBWEAK INTFLDRDY_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTFLDRDY_IRQHandler
                B       INTFLDRDY_IRQHandler

                END
